client/tests/artillery/stressTest.yaml
config:
  target: 'http://127.0.0.1:3001'
  processor: './artillery-functions.js'
  payload:
    path: './rooms.csv'
    fields:
      - roomId
    order: sequence # each VU gets next room, cycles when exhausted
    skipHeader: true
  socketio:
    transports: ['websocket', 'polling']
    upgrade: false
  phases:
    - duration: 30
      arrivalRate: 67
      name: 'Warm up' # 2000
    - duration: 30
      arrivalRate: 200
      name: 'Medium load' # 6000
    - duration: 30
      arrivalRate: 400
      name: 'High load' # 12000
    - duration: 60
      arrivalRate: 1000
      name: 'Stress'
  engines:
    socketio:
      timeout: 30000
  defaults:
    headers:
      Connection: 'keep-alive'
      User-Agent: 'Artillery-Test-{{ $uuid }}'

before:
  flow:
    - post:
        url: '/auth/login'
        json:
          email: 'loadtest@test.com'
          password: 'testpassword'
        capture:
          - json: '$.accessToken'
            as: 'authToken'
        afterResponse: 'extractCookieAndUserId'

scenarios:
  - name: 'stressTest'
    engine: socketio
    flow:
      # - log: 'VU joining roomId: {{ roomId }}'
      - emit:
          channel: 'authenticate'
          data:
            token: '{{ authToken }}'
      - think: 1
      - emit:
          channel: 'room:join'
          data:
            roomId: '{{ roomId }}'
      - think: 1
      - loop:
          - emit:
              channel: 'canvas:operation'
              data:
                strokeSequenceNumber: '{{ $loopCount }}'
                strokes:
                  - x: '{{ $randomNumber(0, 10) }}'
                    y: '{{ $randomNumber(0, 10) }}'
                    timestamp: '{{ $timestamp }}'
                  - x: '{{ $randomNumber(0, 10) }}'
                    y: '{{ $randomNumber(0, 10) }}'
                    timestamp: '{{ $timestamp }}'
                strokeId: '{{ $uuid }}'
                canvasMessageId: '{{ $randomNumber(0,10000) }}-{{ userId }}'
                category: 'drawing'
                type: 'drawing'
                packageSequenceNumber: '{{ $loopCount }}'
                authorId: '{{ userId }}'
                isLastPackage: false
                roomId: '{{ roomId }}'
          - think: 0.1
        count: 10
      - emit:
          channel: '__disconnect'
          data: {}